vyomkeshj/esp32_openai_firmware/src/Audio.cpp
  // Initialize SpeexDSP preprocessing for VAD
  if (!dsp.beginMicPreprocess(MIC_COPY_SAMPLES, SAMPLE_RATE)) {
    Serial.println("VAD preprocessing initialization failed!");
    vTaskDelete(NULL);
    return;
  }
  
  dsp.enableMicVAD(true);
  dsp.setMicVADThreshold(50); // More sensitive
  dsp.enableMicNoiseSuppression(true);
  dsp.setMicNoiseSuppressionLevel(-20); // Less aggressive noise suppression
  Serial.println("VAD preprocessing initialized with threshold 20 and light noise suppression");
  
  // Create separate I2S stream for VAD
  I2SStream vadI2S;
  auto i2sConfig = vadI2S.defaultConfig(RX_MODE);
  i2sConfig.bits_per_sample  = BITS_PER_SAMPLE;   // 16-bit PCM
  i2sConfig.sample_rate      = SAMPLE_RATE;       // 16000 Hz
  i2sConfig.channels         = CHANNELS;          // Mono
  i2sConfig.i2s_format       = I2S_STD_FORMAT;
  i2sConfig.channel_format   = I2S_CHANNEL_FMT_ONLY_LEFT;
  i2sConfig.pin_bck          = I2S_SCK;
  i2sConfig.pin_ws           = I2S_WS;
  i2sConfig.pin_data         = I2S_SD;
  i2sConfig.port_no          = I2S_PORT_IN;
  
  if (!vadI2S.begin(i2sConfig)) {
    Serial.println("VAD I2S initialization failed!");
    vTaskDelete(NULL);
    return;
  }
  Serial.println("VAD I2S initialized successfully");
  
  // Buffer for VAD processing
  int16_t audioSamples[MIC_COPY_SAMPLES];
  
  while (1) {
    if (vadEnabled) {
      // Read audio data directly from I2S
      size_t bytesRead = vadI2S.readBytes((uint8_t*)audioSamples, MIC_COPY_SAMPLES * sizeof(int16_t));
      
      if (bytesRead > 0) {
        // Calculate RMS first to see signal level
        long sum = 0;
        int sampleCount = bytesRead / 2; // Convert bytes to 16-bit samples
        for (int i = 0; i < sampleCount; i++) {
          sum += (long)audioSamples[i] * audioSamples[i];
        }
        float rms = sqrt((float)sum / sampleCount);
        
        // Only process if we have enough samples (at least 160 samples = 10ms at 16kHz)
        if (sampleCount >= 160) {
          // Process audio through SpeexDSP preprocessing (includes VAD)
          dsp.preprocessMicAudio(audioSamples);
          
          // Check for voice activity using SpeexDSP VAD
          if (dsp.isMicVoiceDetected()) {
            // Only trigger if signal is strong enough (RMS > 500) and enough time has passed
            static unsigned long lastVADTime = 0;
            static unsigned long voiceDetectedTime = 0;
            unsigned long now = millis();
            
            if (rms > 500.0f && now - lastVADTime > 1000) { // Lower RMS threshold, 1 second debounce
              lastVADTime = now;
              voiceDetectedTime = now;
              Serial.println("Voice detected! Stopping playback");
              
              // Temporarily disable playback
              playbackActive = false;
              
              // Clear the speaker buffer to stop current audio
              audioBuffer.clear();
              i2sOutputFlushScheduled = true;
              
              // Also flush volume streams and queue for immediate stop
              volume.flush();
              volumePitch.flush();
              queue.flush();
            }
            
            // Re-enable playback after 2 seconds of silence
            if (voiceDetectedTime > 0 && now - voiceDetectedTime > 2000) {
              playbackActive = true;
              voiceDetectedTime = 0;
              Serial.println("Re-enabling playback");
            }
          }
        }
      } else {
        // No data available, wait a bit
        vTaskDelay(1);
      }
    } else {
      // VAD disabled, wait longer
      vTaskDelay(100);
    }
  }
}

// ---------------- WS EVENTS ----------------
void webSocketEvent(WStype_t type, uint8_t *payload, size_t length)
{
  switch (type)
  {
  case WStype_DISCONNECTED:
    Serial.printf("[WSc] Disconnected!\n");
    playbackActive = false;
    deviceState = IDLE;
    break;

  case WStype_CONNECTED:
    Serial.printf("[WSc] Connected to url: %s\n", payload);
    // Enter talking baseline (mic on, playback off)
    playbackActive = false;
    deviceState = PROCESSING;
    // allow immediate mic TX after connect
    micTxUnmuteAt = millis();
    break;

  case WStype_TEXT: {
    Serial.printf("[WSc] get text: %s\n", payload);

    JsonDocument doc; // v7 style
    DeserializationError error = deserializeJson(doc, (char*)payload);
    if (error) {
      Serial.println("Error deserializing JSON");
      deviceState = IDLE;
      return;
    }

    String type = doc["type"].as<String>();

    // auth
    if (type == "auth") {
      if (doc["volume_control"].is<int>()) {
        currentVolume = doc["volume_control"].as<int>();
        volume.setVolume(currentVolume / 100.0f);
        volumePitch.setVolume(currentVolume / 100.0f);
      }
      if (doc["pitch_factor"].is<float>()) {
        currentPitchFactor = doc["pitch_factor"].as<float>();
        if (currentPitchFactor != 1.0f) {
          auto pcfg = pitchShift.defaultConfig();
          pcfg.copyFrom(info);
          pcfg.pitch_shift = currentPitchFactor;
          pcfg.buffer_size = 512;
          pitchShift.begin(pcfg);
        }
      }
      bool is_ota   = doc["is_ota"].is<bool>()   ? doc["is_ota"].as<bool>()   : false;
      bool is_reset = doc["is_reset"].is<bool>() ? doc["is_reset"].as<bool>() : false;

      if (is_ota)  { Serial.println("OTA update received"); setOTAStatusInNVS(OTA_IN_PROGRESS); ESP.restart(); }
      if (is_reset){ Serial.println("Factory reset received"); ESP.restart(); }
    }

    // server
    if (type == "server") {
      String msg = doc["msg"].as<String>();
      Serial.println(msg);

      const bool ignoreStale = ignoreStaleActive();

      if (msg == "USER.SPEECH.START") {
        // Flush any pending TTS; keep mic streaming and inform server
        i2sOutputFlushScheduled = true;
        if (playbackActive) {
          unsigned long ms = getSpeakingDuration();
          transitionToListening();   // playback OFF, mic ON
          sendInterruptInstruction(ms);
        } else {
          transitionToListening();   // ensure clean state
        }

      } else if (msg == "RESPONSE.COMPLETE" || msg == "RESPONSE.ERROR") {
        if (doc["volume_control"].is<int>()) {
          int newVolume = doc["volume_control"].as<int>();
          volume.setVolume(newVolume / 100.0f);
          volumePitch.setVolume(newVolume / 100.0f);
        }

        // If we're within ignore window, do nothing; else schedule a tidy playback-off transition.
        if (!ignoreStale && playbackActive == true) {
          scheduleListeningRestart = true;
          scheduledTime = millis() + 1000;
        } else {
          scheduleListeningRestart = false;
        }

      } else if (msg == "AUDIO.COMMITTED") {
        // Only allow this to push us toward PROCESSING if we were actually playing back and not ignoring stale events
        if (!ignoreStale && playbackActive) {
          deviceState = PROCESSING;
        }

      } else if (msg == "RESPONSE.CREATED") {
        // Start playback for this fresh response (mic stays on)
        if (!ignoreStale) {
          transitionToSpeaking(); // playback ON, mic ON
        }

      } else if (msg == "CLEAR_BUFFER") {
        Serial.println("Received CLEAR_BUFFER, clearing audio buffer and stopping playback");
        // Stop playback immediately
        playbackActive = false;
        // Clear the audio buffer to stop any pending audio
        audioBuffer.clear();
        // Flush the I2S output to immediately stop speaker audio
        i2sOutputFlushScheduled = true;
        // Also flush volume streams immediately for instant audio stop
        i2s.flush();
        volume.flush();
        volumePitch.flush();
        queue.flush();
        
